// 간단한 정육면체(창고, 도소매점 등) 모델 데이터 (.obj 형식)
export const cubeModel = `
# Vertices
v -1.0 -1.0 -1.0
v -1.0 -1.0 1.0
v -1.0 1.0 1.0
v -1.0 1.0 -1.0
v 1.0 -1.0 -1.0
v 1.0 -1.0 1.0
v 1.0 1.0 1.0
v 1.0 1.0 -1.0
# Faces
f 1 2 3 4
f 5 8 7 6
f 1 5 6 2
f 2 6 7 3
f 3 7 8 4
f 5 1 4 8
`;

// 굴뚝이 있는 공장 모양 모델 데이터 (.obj 형식)
export const factoryModel = `
# main building vertices
v -1.0 -1.0 -1.0
v -1.0 -1.0 1.0
v -1.0 1.0 1.0
v -1.0 1.0 -1.0
v 1.0 -1.0 -1.0
v 1.0 -1.0 1.0
v 1.0 1.0 1.0
v 1.0 1.0 -1.0
# chimney vertices
v 0.4 1.0 0.4
v 0.4 1.0 0.8
v 0.8 1.0 0.8
v 0.8 1.0 0.4
v 0.4 2.0 0.4
v 0.4 2.0 0.8
v 0.8 2.0 0.8
v 0.8 2.0 0.4
# Faces
# main building
f 1 2 3 4
f 5 8 7 6
f 1 5 6 2
f 2 6 7 3
f 3 7 8 4
f 5 1 4 8
# chimney
f 9 10 11 12
f 13 16 15 14
f 9 13 14 10
f 10 14 15 11
f 11 15 16 12
f 12 16 13 9
`;